# InvalidConnectionRef Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..InvalidConnectionRef Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The selected fitting has invalid connections and must be deleted to continue.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidConnectionRef { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidConnectionRef As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidConnectionRef {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace